Рабочая.Задачи2/src/Documents/ЦБР_Задание/ЦБР_Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦБР_Задание</name>
  <registerRecords>AccumulationRegister.ЦБР_ЧасыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_СогласованоЗакрытоЧасов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_КоличествоЧасовСотрудниковПоЗадачам</registerRecords>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПереписка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрикрепленныйФайл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаСчетКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийКСогласованию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетГарантииОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДополнительное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоФакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущееЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>Принято</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочнаяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадачу</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСтруктуру</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРешитьПриПодключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыСогласованы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоУточнениеТребований</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланСтарый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Предшественники</name>
    <attributes>
      <name>Предшественник</name>
      <type>
        <types>DocumentRef.ЦБР_Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗависимости</name>
      <type>
        <types>EnumRef.ЦБР_ТипЗависимостиЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭффективныеЧасы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеКалендаря</name>
      <type>
        <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧасыЗП</name>
    <attributes>
      <name>ПериодЗП</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаСчетКомпании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Рабочая.Задачи2/src/Enums/ЦБР_ТипОценкиЗадачи/ЦБР_ТипОценкиЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ТипОценкиЗадачи</name>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
  <enumValues>
    <name>Предсогласованные</name>
  </enumValues>
  <enumValues>
    <name>Стандартная</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Documents/ЦБР_Задание/Forms/ФормаДобавленияЭффективныхЧасов/Module.bsl
#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДатаСеанса();
		
	Если Параметры.Свойство("Комментарий") Тогда 
		Комментарий = Параметры.Комментарий;
	КонецЕсли;
	
	Если Параметры.Свойство("Задание") Тогда 
		
		Задание = Параметры.Задание; 
		
		РеквизитыЗадания = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Задание, "СсылкаНаЗадачу, ТрудозатратыПлан, ТрудозатратыФакт, ТипОценкиЗадачи, ОплатаПоФакту, УдалосьРешитьПриПодключении, ОплатаПоФакту, Исполнитель"); 
		Задача          = РеквизитыЗадания.СсылкаНаЗадачу;
		ТипОценкиЗадачи = РеквизитыЗадания.ТипОценкиЗадачи;
		ПоФакту         = РеквизитыЗадания.ОплатаПоФакту;
		Исполнитель     = РеквизитыЗадания.Исполнитель;
		Если ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.Предсогласованные") Тогда
			ЧасовДоступно = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьОстатокПредсогласованныхЧасов(Задача);  
		Иначе
			ЧасовДоступно = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьОстатокЧасовПоЗаданию(Задание);  
			КоличествоЗаданийВЗадаче = ЦБР_ЗадачиЗаданияВызовСервера.КоличествоЗаданийВЗадаче(Задача);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РешеноПриПервомПодключении", "Видимость", КоличествоЗаданийВЗадаче = 1 И Не РеквизитыЗадания.УдалосьРешитьПриПодключении);	
		КонецЕсли;
		ЧасовДоступноПредставление = ЧасовДоступно;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) И Не ЦБР_ЗадачиЗаданияВызовСервера.ЕстьПравоСписанияЧасовПоЗаданию(Исполнитель, Задача) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЧасовДоступно", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДобавитьВсеДоступныеЧасы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЭффективныеЧасы", "Видимость", Ложь);
	ИначеЕсли ЧасовДоступно > 0 Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЧасовДоступно", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДобавитьВсеДоступныеЧасы", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЭффективныеЧасы", "Видимость", Истина);
	ИначеЕсли ПоФакту Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЧасовДоступно", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДобавитьВсеДоступныеЧасы", "Видимость", Ложь);		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЭффективныеЧасы", "Видимость", Истина);
		ЧасовДоступноПредставление = "по факту";
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЧасовДоступно", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДобавитьВсеДоступныеЧасы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЭффективныеЧасы", "Видимость", Ложь);
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаОкончания") Тогда 
		ДатаОкончания = Параметры.ДатаОкончания;
	КонецЕсли;

	Если Параметры.Свойство("ПоПлану") Тогда
		ПоПлану = Параметры.ПоПлану;
	КонецЕсли;  
	
	Если Параметры.Свойство("Описание") Тогда
		Описание = Параметры.Описание;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаписьОС") Тогда
		ЗаписьОС = Параметры.ЗаписьОС;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикКомандФормы

&НаКлиенте
Процедура Добавить(Команда)	

	Если ОписаниеВыполненнойРаботы.Элементы.Количество() = 0 Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Описание выполненной работы"" не заполненно!",,"ОписаниеВыполненнойРаботы","ОписаниеВыполненнойРаботы");
		Возврат;	
	КонецЕсли;
	
	Если ЭффективныеЧасы > ЧасовДоступно И Не ПоФакту Тогда		 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Количество эффективных часов превышает, количество доступных!");
		Возврат;	
	КонецЕсли;
	
	Если РешеноПриПервомПодключении Тогда 
		ЭффективныеЧасы = 0.5;	   
	КонецЕсли;
	
	ВыполнитьПроцедурыЗакрытияФормы();
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсеДоступныеЧасы(Команда)
	ЭффективныеЧасы = ЧасовДоступно;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РешеноПриПервомПодключенииПриИзменении(Элемент)
	
	Если ОписаниеВыполненнойРаботы.Элементы.Количество() = 0 Тогда   
		ОписаниеВыполненнойРаботы.Добавить("Решено при первом подключении.", ТипЭлементаФорматированногоДокумента.Текст);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПроцедурыЗакрытияФормы()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаписьОС", ЗаписьОС);
	ДанныеЗаполнения.Вставить("ЗаданиеСсылка", Задание);  
	ДанныеЗаполнения.Вставить("ЗадачаСсылка", Задача);  
	ДанныеЗаполнения.Вставить("ЭффективныеЧасы", ЭффективныеЧасы); 
	ДанныеЗаполнения.Вставить("Дата", Дата);
	ДанныеЗаполнения.Вставить("ЗакрытьЗадание", ЗакрытьЗадание);
	ДанныеЗаполнения.Вставить("РешеноПриПервомПодключении", РешеноПриПервомПодключении);
	ДанныеЗаполнения.Вставить("ОписаниеВыполненнойРаботы", ОписаниеВыполненнойРаботы);
	ДанныеЗаполнения.Вставить("ПоПлану", ПоПлану);
	
	ЦБР_ЗадачиЗаданияВызовСервера.ЗаписатьЧасыВЗадачу(ДанныеЗаполнения);
	ЦБР_ЗадачиЗаданияВызовСервера.УстановитьОтработана(ДанныеЗаполнения);
	
	УведомлениеВОбсуждение();
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьПолЧасаЗаРешение()	  
	
	ПредметОбъект = Задание.ПолучитьОбъект();	
	ПредметОбъект.ТрудозатратыПлан = 0.5;
	ПредметОбъект.УдалосьРешитьПриПодключении = Истина;
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(ПредметОбъект, Перечисления.ЦБР_Состояние.Выполнен);
    ПредметОбъект.Записать(); 
	
КонецПроцедуры

&НаСервере
Процедура УведомлениеВОбсуждение()
	
	Получатели = Новый Массив;     		
	Получатели.Добавить(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Задача, "Постановщик"));
	ТекстСообщения = СтрШаблон("Действие: %1%2Результат: %3", Описание, Символы.ПС, ОписаниеВыполненнойРаботы.ПолучитьТекст());
	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задача, "РезультатОС", Получатели, ТекстСообщения); 
	
КонецПроцедуры

#КонецОбласти
